app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def create
    @role = Role.new(role_params)
    authorize @role
    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 14 Feb 2014 07:34:06 UTC +00:00], ["name", "admin"], ["updated_at", Fri, 14 Feb 2014 07:34:06 UTC +00:00]]

  def update
    authorize @role
    respond_to do |format|
      if @role.update(role_params)
---
UPDATE "roles" SET "name" = ?, "updated_at" = ? WHERE "roles"."id" = 5  [["name", "testrolesadfv"], ["updated_at", Fri, 14 Feb 2014 13:20:46 UTC +00:00]]

  def destroy
    authorize @role
    @role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 2]]

    def set_role
      @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "2"]]