app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])
    authorize user
    unless user == current_user
      user.destroy